tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "sanemat/font"

brew "asdf"
brew "bash"
brew "cairo"
brew "ca-certificates"
brew "fontforge"
brew "fzf"
brew "ghq"
brew "git"
brew "gnupg"
brew "openssl@3"
brew "paperkey"
brew "pinentry-mac"
brew "python@3.9"
brew "qrencode"
brew "readline", link: true
brew "sanemat/font/ricty"
brew "starship"
brew "stow"
brew "tree"
brew "ykman"
brew "zsh"

cask "alfred"
cask "authy"
#cask "brave-browser"
#cask "cheatsheet"
#cask "clipy"
#cask "deepl"
cask "discord"
cask "figma"
cask "font-hackgen-nerd"
cask "gather"
#cask "google-japanese-ime"
#cask "google-chrome"
#cask "iceberg"
cask "keybase"
#cask "kindle"
#cask "nordvpn"
cask "nordpass"
cask "signal"
cask "slack"
cask "spotify"
cask "spotmenu"
#cask "stack"
cask "telegram"
#cask "visual-studio-code"
cask "whatsapp"
