tap "homebrew/bundle"
tap "homebrew/cask-fonts"

brew "asdf"
brew "fzf"
brew "ghq"
brew "git"
brew "gnupg"
brew "gpgme"
# brew "paperkey"
brew "pinentry-mac"
# brew "qrencode"
brew "starship"
brew "stow"
brew "ykman"

cask "alfred"
cask "authy"
cask "brave-browser"
cask "cursor"
cask "deepl"
cask "discord"
cask "figma"
cask "font-hackgen"
cask "font-hackgen-nerd"
# cask "gather"
cask "google-chrome"
cask "google-japanese-ime"
# cask "keka"
cask "keybase"
cask "kindle"
cask "nordpass"
cask "nordvpn"
# cask "signal"
cask "postman"
cask "proton-drive"
cask "protonmail-bridge"
cask "pycharm-ce"
cask "slack"
cask "spotify"
# cask "telegram"
cask "thunderbird"
cask "visual-studio-code"
cask "yubico-yubikey-manager"
# cask "whatsapp"

vscode "bpruitt-goddard.mermaid-markdown-syntax-highlighting"
vscode "bradlc.vscode-tailwindcss"
vscode "chrmarti.regex"
vscode "cweijan.dbclient-jdbc"
vscode "cweijan.vscode-database-client2"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "ecmel.vscode-html-css"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-rename-tag"
vscode "genieai.chatgpt-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "gruntfuggly.todo-tree"
vscode "harg.iceberg"
vscode "huff-language.huff-language"
vscode "humao.rest-client"
vscode "ics.japanese-proofreading"
vscode "isobe-h.markdown-character-count"
vscode "juanblanco.solidity"
vscode "kevinrose.vsc-python-indent"
vscode "mechatroner.rainbow-csv"
vscode "mgmcdermott.vscode-language-babel"
vscode "mhutchie.git-graph"
vscode "mosapride.zenkaku"
vscode "ms-ceintl.vscode-language-pack-ja"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.flake8"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vsliveshare.vsliveshare"
vscode "mushan.vscode-paste-image"
vscode "nomicfoundation.hardhat-solidity"
vscode "oderwat.indent-rainbow"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "smelukov.vscode-csstree"
vscode "spywhere.guides"
vscode "streetsidesoftware.code-spell-checker"
vscode "stylelint.vscode-stylelint"
vscode "taichi.vscode-textlint"
vscode "tamasfe.even-better-toml"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscode-icons-team.vscode-icons"
vscode "vue.volar"
vscode "wix.vscode-import-cost"
vscode "yzhang.markdown-all-in-one"
vscode "zignd.html-css-class-completion"
