tap "homebrew/bundle"
# tap "homebrew/cask"
tap "homebrew/cask-fonts"
# tap "homebrew/core"

brew "asdf"
brew "fzf"
brew "ghq"
brew "git"
brew "gnupg"
# brew "paperkey"
brew "pinentry-mac"
# brew "qrencode"
brew "starship"
brew "stow"
brew "ykman"

cask "alfred"
cask "authy"
cask "brave-browser"
cask "deepl"
cask "discord"
cask "figma"
cask "font-hackgen"
cask "font-hackgen-nerd"
# cask "gather"
cask "google-chrome"
cask "google-japanese-ime"
cask "keka"
cask "keybase"
cask "kindle"
cask "nordpass"
cask "nordvpn"
# cask "signal"
# cask "slack"
cask "postman"
cask "proton-drive"
cask "protonmail-bridge"
cask "pycharm-ce"
cask "spotify"
# cask "telegram"
cask "thunderbird"
cask "visual-studio-code"
# cask "whatsapp"

vscode "bradlc.vscode-tailwindcss"
vscode "chris-hayes.chatgpt-reborn"
vscode "chrmarti.regex"
vscode "cweijan.vscode-database-client2"
vscode "DavidAnson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "dsznajder.es7-react-js-snippets"
vscode "ecmel.vscode-html-css"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-rename-tag"
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "GitHub.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "Gruntfuggly.todo-tree"
vscode "harg.iceberg"
vscode "humao.rest-client"
vscode "isobe-h.markdown-character-count"
vscode "JuanBlanco.solidity"
vscode "KevinRose.vsc-python-indent"
vscode "mechatroner.rainbow-csv"
vscode "mgmcdermott.vscode-language-babel"
vscode "mhutchie.git-graph"
vscode "mosapride.zenkaku"
vscode "MS-CEINTL.vscode-language-pack-ja"
vscode "ms-python.black-formatter"
vscode "ms-python.flake8"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vsliveshare.vsliveshare"
vscode "mushan.vscode-paste-image"
vscode "NomicFoundation.hardhat-solidity"
vscode "oderwat.indent-rainbow"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.LiveServer"
vscode "smelukov.vscode-csstree"
vscode "spywhere.guides"
vscode "streetsidesoftware.code-spell-checker"
vscode "stylelint.vscode-stylelint"
vscode "taichi.vscode-textlint"
vscode "tamasfe.even-better-toml"
vscode "VisualStudioExptTeam.intellicode-api-usage-examples"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "vscode-icons-team.vscode-icons"
vscode "Vue.volar"
vscode "wix.vscode-import-cost"
vscode "yzhang.markdown-all-in-one"
vscode "Zignd.html-css-class-completion"
